app/views/events/_form.html.erb

    <strong> Customer Name </strong><br>
    <%= Customer.find_by_id(params[:customer_id]).first_name %>
---
SELECT `customers`.* FROM `customers` WHERE `customers`.`id` IS NULL LIMIT 1

    <%= f.label :therapist_id %><br>
    <%= f.collection_select :therapist_id, Therapist.order(:nick_name),:id,:nick_name, include_blank: true %>
---
SELECT `therapists`.* FROM `therapists` ORDER BY `therapists`.`nick_name` ASC

    <%= f.label :location_id %><br>
    <%= f.collection_select :location_id, Location.order(:name),:id,:name, include_blank: true %>
---
SELECT `locations`.* FROM `locations` ORDER BY `locations`.`name` ASC

    <%= f.label :room_id %><br>
    <%= f.collection_select :room_id, Room.order(:name),:id,:name, include_blank: true %>
---
SELECT `rooms`.* FROM `rooms` ORDER BY `rooms`.`name` ASC

    <%= f.label :service_id %><br>
    <%= f.collection_select :service_id, Service.order(:name),:id,:name, include_blank: true %>
---
SELECT `services`.* FROM `services` ORDER BY `services`.`name` ASC