app/views/events/_index.html.erb

SELECT `events`.* FROM `events`
---

  g.column name: 'Event Date', attribute: 'starts_at'