app/views/events/show.html.erb

  <strong>Customer:</strong>
  <%= Customer.find_by_id(@event.customer_id).first_name %> <%= Customer.find_by_id(@event.customer_id).last_name %>
---
SELECT `customers`.* FROM `customers` WHERE `customers`.`id` = 1 LIMIT 1

  <strong>Therapist:</strong>
	<%= Therapist.find_by_id(@event.therapist_id).nick_name %>
---
SELECT `therapists`.* FROM `therapists` WHERE `therapists`.`id` = 1 LIMIT 1

  <strong>Location:</strong>
  <%= Location.find_by_id(@event.location_id).name %>
---
SELECT `locations`.* FROM `locations` WHERE `locations`.`id` = 1 LIMIT 1

  <strong>Room:</strong>
	<%= Room.find_by_id(@event.room_id).name %>
---
SELECT `rooms`.* FROM `rooms` WHERE `rooms`.`id` = 5 LIMIT 1

  <strong>Service:</strong>
  <%= Service.find_by_id(@event.service_id).name %>
---
SELECT `services`.* FROM `services` WHERE `services`.`id` = 3 LIMIT 1