app/views/customers/show.html.erb

SELECT `services`.* FROM `services` WHERE `services`.`id` = 3 LIMIT 1
---
  <p>
    <%= link_to(Service.find_by_id(event.service_id).name, event_path(event.service_id)) %> on  <%= event.starts_at  %>