app/controllers/customers_controller.rb

SELECT `events`.* FROM `events` WHERE `events`.`customer_id` = 3
---
  def show
    @events = Event.where(customer_id: @customer.id)

UPDATE `customers` SET `first_name` = 'Fox', `last_name` = 'Holt', `nick_name` = 'Foxy', `gender` = 'Male', `address` = '7136 Meadow Lake\r\nDallas, Tx 75214', `phone_number` = '214-828-1932', `gender_pref` = 'Female', `updated_at` = '2014-04-09 02:28:11' WHERE `customers`.`id` = 1
---
  def update
    respond_to do |format|
      if @customer.update(customer_params)