app/controllers/events_controller.rb

SELECT `events`.* FROM `events` WHERE ('2014-03-30 00:00:00' < starts_at < '2014-05-11 00:00:00')
---
  def index
    @events_grid = initialize_grid(Event, include: [:customer, :therapist, :location, :room, :service], order: 'events.starts_at')
    @events = Event.all

SELECT `customers`.* FROM `customers` WHERE `customers`.`id` IS NULL LIMIT 1
---
  def edit
    print "++++++++++++++++ Customer Id = ", @event.customer_id
    @customer = Customer.find_by_id(@event.customer_id)

SELECT `services`.* FROM `services` WHERE `services`.`id` = 2 LIMIT 1
INSERT INTO `events` (`cancel`, `cancel_reason`, `created_at`, `customer_id`, `location_id`, `room_id`, `service_id`, `starts_at`, `stops_at`, `therapist_id`, `updated_at`, `walkin`) VALUES (0, '', '2014-04-03 19:30:21', 1, 1, 1, 1, '2014-04-03 19:30:00', '2014-04-03 22:30:00', 2, '2014-04-03 19:30:21', 0)
---
  def create
    @event = Event.new(event_params)
    # Set the stop time at the start time + length of service
    @event.stops_at = @event.starts_at + Service.find_by_id(@event.service_id).time_length.minutes
    respond_to do |format|
      if @event.save

SELECT `customers`.* FROM `customers` WHERE `customers`.`id` = 1 LIMIT 1
UPDATE `events` SET `cancel_reason` = '', `starts_at` = '2014-04-03 21:31:00', `stops_at` = '2014-04-03 23:33:00', `updated_at` = '2014-04-03 21:33:46' WHERE `events`.`id` = 1
---
  def update
      @customer = Customer.find_by_id(@event.customer_id)
      respond_to do |format|
      if @event.update(event_params)

DELETE FROM `events` WHERE `events`.`id` = 5
---
  def destroy
    @event.destroy

SELECT `customers`.* FROM `customers` WHERE `customers`.`id` IS NULL LIMIT 1
---
  def find_customer
    if params[:customer_id]
      print "I made it heree ))))))))))))))))))))))))))))"
      @customer = Customer.find_by_id(params[:customer_id])