app/controllers/events_controller.rb

SELECT COUNT(*) FROM `events` WHERE (( (events.walkin = 0 or events.walkin is null) ))
---
  def index
    @events_grid = initialize_grid(Event, include: [:customer, :therapist, :location, :room, :service], order: 'events.starts_at')
    @events = Event.all
    @events = Event.between(params['start'], params['end']) if (params['start'] && params['end'])
    print "the length is ____++++___", @events.length