app/controllers/rooms_controller.rb

  def index
    @rooms = Room.all
---
SELECT `rooms`.* FROM `rooms`

    def set_room
      @room = Room.find(params[:id])
---
SELECT `rooms`.* FROM `rooms` WHERE `rooms`.`id` = 7 LIMIT 1