app/controllers/services_controller.rb

  def index
    @services = Service.all
---
SELECT `services`.* FROM `services`

    def set_service
      @service = Service.find(params[:id])
---
SELECT `services`.* FROM `services` WHERE `services`.`id` = 1 LIMIT 1